# Important Dev Stuff
brew 'git'
brew 'python'
brew 'ruby'
brew 'mas'
brew 'thefuck'
brew 'the_silver_searcher'
brew 'vim'
brew 'tmux'
brew 'zsh'

if ENV.fetch("SHELL", "") != "/usr/local/bin/zsh"
  puts "To use the Homebrew-installed ZSH:"
  puts "  sudo echo /usr/local/bin/zsh >> /etc/shells"
  puts "  chsh -s /usr/local/bin/zsh"
end


cask 'alfred'
cask 'bartender'
cask 'caffeine'
cask 'discord'
cask 'dropbox'
cask 'emacs'
cask 'etcher'
cask 'firefox'
cask 'flux'
cask 'font-iosevka'
cask 'font-iosevka-nerd-font'
cask 'google-chrome'
cask 'hocus-focus'
cask 'iterm2'
cask 'keyboard-maestro'
cask 'licecap'
cask 'postman'
cask 'spectacle'
cask 'visual-studio-code'
cask 'transmission'

mas '1Password',        id: 443987910
mas 'Bear',             id: 1091189122
mas 'Fantastical 2',    id: 975937182
mas 'Mitch for Twitch', id: 1231862724
mas 'Things 3',         id: 904280696
mas 'Wallcat',          id: 1000397973
